app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" ORDER BY "users".firstname ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users"
---
	def index
	  @users = User.all
	  @users = User.order(:firstname).page params[:page]