app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
SELECT "movies".* FROM "movies" ORDER BY "movies".title ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "movies"
---
	def index
		@movies = Movie.all
		@movies = Movie.order(:title).page params[:page]

INSERT INTO "movies" ("created_at", "description", "director", "image", "poster_image_url", "release_date", "runtime_in_minutes", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@movie = Movie.new(movie_params)

		if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "image" = ?, "updated_at" = ? WHERE "movies"."id" = 4  [["image", "nightcrawler.jpg"], ["updated_at", Thu, 04 Feb 2016 19:22:57 UTC +00:00]]
---
	def update
    @movie = Movie.find(params[:id])

    if @movie.update_attributes(movie_params)